/**
 * docs/.vuepress/config/navbar.js
 * 网站导航配置
 */

export default [
  {
    text: "本站主页",
    link: "/",
  },
  {
    text: "内部文档",
    link: "/内部文档/",
    children: [
      {
        text: "内容概要",
        link: "/内部文档/",
      },
      {
        text: "组织管理",
        link: "/内部文档/组织管理/",
      },
      {
        text: "集群架构",
        link: "/内部文档/集群架构/",
      },
      {
        text: "学习路线",
        link: "/内部文档/学习路线/",
      },
      {
        text: "标准规格",
        link: "/内部文档/标准规格/",
      },
    ],
  },
  {
    text: "其他内容",
    link: "/其他内容/",
    children: [
      {
        text: "内容概要",
        link: "/其他内容/",
      },
      {
        text: "查阅说明",
        link: "/其他内容/查阅说明/",
      },
      {
        text: "书籍推荐",
        link: "/其他内容/书籍推荐/",
      },
      {
        text: "平台详情",
        link: "/其他内容/平台详情/",
      },
      {
        text: "发布文章",
        link: "/其他内容/发布文章/",
      },
      {
        text: "使用反馈",
        link: "/其他内容/使用反馈/",
      },
      {
        text: "本站测试",
        link: "/其他内容/本站测试/",
      },
      {
        text: "站长计划",
        link: "/其他内容/站长计划/",
      },
    ],
  },
  {
    text: "项目手册",
    link: "/项目手册/",
    children: [
      {
        text: "内容概要",
        link: "/项目手册/",
      },
      {
        text: "工作室文档平台系统",
        link: "/项目手册/工作室文档平台系统/",
      },
      {
        text: "工作室毕业选题系统",
        link: "/项目手册/工作室毕业选题系统/",
      },
      {
        text: "工作室综合评测系统",
        link: "/项目手册/工作室综合评测系统/",
      },
      {
        text: "工作室考勤报销系统",
        link: "/项目手册/工作室考勤报销系统/",
      },
    ],
  },
  {
    text: "编程修养",
    link: "/编程修养/",
    children: [
      {
        text: "内容概要",
        link: "/编程修养/",
      },
      {
        text: "编程语言",
        link: "/编程修养/编程语言/",
      },
      {
        text: "数构算法",
        link: "/编程修养/数构算法/",
      },
      {
        text: "系统网络",
        link: "/编程修养/系统网络/",
      },
      {
        text: "数据存储",
        link: "/编程修养/数据存储/",
      },
      {
        text: "计组原理",
        link: "/编程修养/计组原理/",
      },
    ],
  },
  {
    text: "开发方向",
    link: "/开发方向/",
    children: [
      {
        text: "内容概要",
        link: "/开发方向/",
      },
      {
        text: "业务开发",
        link: "/开发方向/业务开发/",
      },
      {
        text: "系统开发",
        link: "/开发方向/系统开发/",
      },
      {
        text: "嵌入开发",
        link: "/开发方向/嵌入开发/",
      },
      {
        text: "页面开发",
        link: "/开发方向/页面开发/",
      },
      {
        text: "桌面开发",
        link: "/开发方向/桌面开发/",
      },
      {
        text: "移动开发",
        link: "/开发方向/移动开发/",
      },
      {
        text: "组件开发",
        link: "/开发方向/组件开发/",
      },
    ],
  },
  {
    text: "软件设计",
    link: "/软件设计/",
    children: [
      {
        text: "内容概要",
        link: "/软件设计/",
      },
      {
        text: "软件工程",
        link: "/软件设计/软件工程/",
      },
      {
        text: "系统架构",
        link: "/软件设计/系统架构/",
      },
      {
        text: "设计模式",
        link: "/软件设计/设计模式/",
      },
      {
        text: "编码规格",
        link: "/软件设计/编码规范/",
      },
    ],
  },
  {
    text: "服务集群",
    link: "/服务集群/",
    children: [
      {
        text: "内容概要",
        link: "/服务集群/",
      },
      {
        text: "服务搭建",
        link: "/服务集群/服务搭建/",
      },
      {
        text: "分布架构",
        link: "/服务集群/分布架构/",
      },
      {
        text: "云微服务",
        link: "/服务集群/云微服务/",
      },
      {
        text: "集群部署",
        link: "/服务集群/集群部署/",
      },
    ],
  },
  {
    text: "理论研究",
    link: "/理论研究/",
    children: [
      {
        text: "内容概要",
        link: "/理论研究/",
      },
      {
        text: "图像视觉",
        link: "/理论研究/图像视觉/",
      },
      {
        text: "机器学习",
        link: "/理论研究/机器学习/",
      },
    ],
  },
];

// TODO: 新增加一个大类内容, 就在这里添加一个父项, 就必须添加对应的子项, 如果没有子项就说明内容还不够健全...
